adulting_app_api/app/controllers/event_results_controller.rb

  def index
    @event_results = EventResult.all
---
SELECT "event_results".* FROM "event_results"